app/Controllers/Admin.php

    public function TambahNewsAndBlog()
    {
        $data = [
            'title' => 'Tambah',
            'subtitle' => 'News And Blog',
            'AmbilDataJoinKategoriNewsAndBlog' => $this->NewsAndBlogModel
                ->where('deleted_at', null)
                ->getNewsAndBlogWithCategory(),
            'kategoriData' => $this->KategoriNewsAndBlogModel
                ->findAll(),
        ];
---
SELECT *
FROM `tbl_kategori_newsandblog`
WHERE `tbl_kategori_newsandblog`.`deleted_at` IS NULL

    public function SemuaMenuDinamis()
    {
        $data = [
            'title' => 'Semua',
            'subtitle' => 'Menu Dinamis',
            'AmbilMenuDinamisModel' => $this->MenuDinamisModel->findAll(),
            'AmbilMenuSubDinamisModel' => $this->MenuSubDinamisModel->findAll(),
            'AmbilMenuSubSubDinamisModel' => $this->MenuSubSubDinamisModel->findAll(),
---
SELECT *
FROM `tbl_menu_dinamis`
WHERE `tbl_menu_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_dinamis`
WHERE `tbl_menu_sub_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_sub_dinamis`
WHERE `tbl_menu_sub_sub_dinamis`.`deleted_at` IS NULL