app/Controllers/Home.php

    public function index(): string
    {
        $data = [
            'title' => 'SMK Negeri 1 Tanjung Jabung Timur',
            'subtitle' => '',
            'AmbilDataSiswa123' => $this->NewsAndBlogModel->getSiswa123(),
            'AmbilDataNewsAndBlogTerbaru' => $this->NewsAndBlogModel->getNewsAndBlogWithCategoryLatest(),
            'AmbilDataJoinKategoriNewsAndBlog1' => $this->NewsAndBlogModel->getNewsAndBlogWithCategoryLimited(1, 0),
            'AmbilDataJoinKategoriNewsAndBlog2' => $this->NewsAndBlogModel->getNewsAndBlogWithCategoryLimited(3, 1),
            'AmbilDataWeb' => $this->PengaturanWebModel->where('id_web', 1)->first(),
            'dynamicMenus1' => $this->MenuDinamisModel->findAll(),
            'dynamicMenus2' => $this->MenuSubDinamisModel->findAll(),
            'dynamicMenus3' => $this->MenuSubSubDinamisModel->findAll(),
---
SELECT *
FROM `tbl_menu_dinamis`
WHERE `tbl_menu_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_dinamis`
WHERE `tbl_menu_sub_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_sub_dinamis`
WHERE `tbl_menu_sub_sub_dinamis`.`deleted_at` IS NULL

    public function hasSubMenuLevel3($idSubMenuDinamis)
    {
        $dynamicMenus3 = $this->MenuSubSubDinamisModel->findAll();
---
SELECT *
FROM `tbl_menu_sub_sub_dinamis`
WHERE `tbl_menu_sub_sub_dinamis`.`deleted_at` IS NULL

    public function Visi()
    {
        $data = [
            'title' => 'SMK Negeri 1 Tanjung Jabung Timur',
            'subtitle' => '- Visi',
            'AmbilDataWeb' => $this->PengaturanWebModel->find()
        ];
---
SELECT *
FROM `tbl_web`
WHERE `tbl_web`.`deleted_at` IS NULL

    public function Kontak()
    {
        $data = [
            'title' => 'SMK Negeri 1 Tanjung Jabung Timur',
            'subtitle' => '- Hubungi Kami',
            'AmbilDataWeb' => $this->PengaturanWebModel->where('id_web', 1)->first(),
            'dynamicMenus1' => $this->MenuDinamisModel->findAll(),
---
SELECT *
FROM `tbl_menu_dinamis`
WHERE `tbl_menu_dinamis`.`deleted_at` IS NULL