app/Controllers/Login.php

    public function index()
    {
        $data = [
            'title' => 'SMK Negeri 1 Tanjung Jabung Timur',
            'subtitle' => '- Login',
            'AmbilDataWeb' => $this->PengaturanWebModel->where('id_web', 1)->first(),

            'dynamicMenus1' => $this->MenuDinamisModel->findAll(),
            'dynamicMenus2' => $this->MenuSubDinamisModel->findAll(),
            'dynamicMenus3' => $this->MenuSubSubDinamisModel->findAll(),
---
SELECT *
FROM `tbl_web`
WHERE `id_web` = 1
 LIMIT 1
SELECT *
FROM `tbl_menu_dinamis`
WHERE `tbl_menu_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_dinamis`
WHERE `tbl_menu_sub_dinamis`.`deleted_at` IS NULL
SELECT *
FROM `tbl_menu_sub_sub_dinamis`
WHERE `tbl_menu_sub_sub_dinamis`.`deleted_at` IS NULL

    public function hasSubMenuLevel3($idSubMenuDinamis)
    {
        $dynamicMenus3 = $this->MenuSubSubDinamisModel->findAll();
---
SELECT *
FROM `tbl_menu_sub_sub_dinamis`
WHERE `tbl_menu_sub_sub_dinamis`.`deleted_at` IS NULL