app/Controllers/Superadmin.php

    public function Pengguna()
    {
        $data = [
            'title' => 'Pengguna',
            'subtitle' => 'Manajemen Pengguna',
            'AmbilSemuaDataPengguna' => $this->PenggunaModel->findAll(),
            'AmbilSemuaDataLogin' => $this->LoginModel->findAll(),
        ];
---
SELECT *
FROM `tbl_login`
WHERE `tbl_login`.`deleted_at` IS NULL