app/Controllers/Superadmin.php

SELECT COUNT(*) AS `numrows`
FROM `tbl_transaksi`
WHERE `status` = '1'
AND `tbl_transaksi`.`deleted_at` IS NULL
SELECT SUM(`galon_keluar`) AS `galon_keluar`
FROM `tbl_transaksi`
SELECT COUNT(*) AS `numrows`
FROM `tbl_pelanggan`
WHERE `deleted_at` IS NULL
AND `tbl_pelanggan`.`deleted_at` IS NULL
---
    public function index()
    {
        $data = [
            'title' => 'Beranda',
            'subtitle' => 'Superadmin',
            'TotalGalonKeluar' => $this->TransaksiModel->selectSum('galon_keluar')->get()->getRowArray(),
            'TotalPelanggan' => $this->PelangganModel->where('deleted_at', NULL)->countAllResults(),
            'TotalTransaksiBelumBayar' => $this->TransaksiModel->where('status', '1')->countAllResults(),
            'TotalTransaksiKurangBayar' => $this->TransaksiModel->where('status', '2')->countAllResults(),
            'TotalTransaksiLunas' => $this->TransaksiModel->where('status', '3')->countAllResults(),
        ];

SELECT *
FROM `tbl_pelanggan`
WHERE `tbl_pelanggan`.`deleted_at` IS NULL
---
    public function DepotAir()
    {
        $data = [
            'title' => 'Beranda',
            'subtitle' => 'Depot Air',
            'AmbilSemuaDataDepotAir' => $this->PelangganModel->findAll(),

SELECT *
FROM `tbl_pengguna`
WHERE `tbl_pengguna`.`deleted_at` IS NOT NULL
---
    public function Pengguna()
    {
        $data = [
            'title' => 'Master Data',
            'subtitle' => 'Pengguna',
            'AmbilSemuaDataPengguna' => $this->PenggunaModel->findAll(),
        ];

UPDATE `tbl_pengguna` SET `deleted_at` = '2023-07-23 20:30:31', `updated_at` = '2023-07-23 20:30:31'
WHERE `id_pengguna` = '11'
AND `deleted_at` IS NULL
UPDATE `tbl_login` SET `deleted_at` = '2023-07-23 20:30:31', `updated_at` = '2023-07-23 20:30:31'
WHERE `id_pengguna` = '11'
AND `deleted_at` IS NULL
---
    public function HapusDataPengguna($id_pengguna)
    {
        $this->PenggunaModel->where('id_pengguna', $id_pengguna)->delete();
        $this->LoginModel->where('id_pengguna', $id_pengguna)->delete();

SELECT *
FROM `tbl_pengguna`
WHERE `tbl_pengguna`.`deleted_at` IS NOT NULL
---
    public function PenggunaTerhapus()
    {
        $data = [
            'title' => 'Beranda',
            'subtitle' => 'Depot Air',
            'AmbilSemuaDataPenggunaTerhapus' => $this->PenggunaModel->onlyDeleted()->findAll(),
            'AmbilSemuaDataLoginTerhapus' => $this->PenggunaModel->findAll(),

UPDATE `tbl_pengguna` SET `deleted_at` = NULL, `updated_at` = '2023-07-23 20:33:15'
WHERE `tbl_pengguna`.`id_pengguna` IN ('11')
---
    public function KembalikanPenggunaTerhapus($id_pengguna)
    {
        $data = [
            'id_pengguna' => $id_pengguna,
            'deleted_at' =>  NULL,
        ];
        $this->PenggunaModel->update($id_pengguna, $data);