app/Controllers/Superadmin.php

    public function Pengguna()
    {
        $data = [
            'title' => 'Master Data',
            'subtitle' => 'Pengguna',
            'AmbilSemuaDataPengguna' => $this->PenggunaModel->findAll(),
---
SELECT *
FROM `tbl_pengguna`
WHERE `tbl_pengguna`.`deleted_at` IS NULL

    public function PenggunaTerhapus()
    {
        $data = [
            'title' => 'Beranda',
            'subtitle' => 'Depot Air',
            'AmbilSemuaDataLoginTerhapus' => $this->LoginModel->onlyDeleted()->findAll(),
---
SELECT *
FROM `tbl_login`
WHERE `tbl_login`.`deleted_at` IS NOT NULL

    public function KembalikanPenggunaTerhapus($id_pengguna)
    {
        //Ubah deleted_at menjadi null
        $dataPengguna = [
            'deleted_at' =>  NULL,
        ];
        $this->PenggunaModel->update($id_pengguna, $dataPengguna);
        //Ubah deleted_at menjadi null
        $this->LoginModel->set('deleted_at', null)->where('id_pengguna', $id_pengguna)->update();
---
UPDATE `tbl_pengguna` SET `status` = 2, `updated_at` = '2023-07-27 18:06:54'
WHERE `id_pengguna` = '11'