app/Models/NewsAndBlogModel.php

SELECT *
FROM `tbl_newsandblog`
JOIN `tbl_kategori_newsandblog` ON `tbl_kategori_newsandblog`.`id_kategori_news_and_blog` = `tbl_newsandblog`.`id_kategori_news_and_blog`
WHERE `tbl_newsandblog`.`deleted_at` IS NULL
---
    public function getNewsAndBlogWithCategory()
    {
        $builder = $this->db->table('tbl_newsandblog');
        $builder->join(
            'tbl_kategori_newsandblog',
            'tbl_kategori_newsandblog.id_kategori_news_and_blog = tbl_newsandblog.id_kategori_news_and_blog'
        );
        $builder->where('tbl_newsandblog.deleted_at', null);
        $query = $builder->get();

SELECT `tbl_newsandblog`.*, `tbl_kategori_newsandblog`.`created_at` AS `kategori_created_at`, `tbl_kategori_newsandblog`.`warna_kategori_news_and_blog` AS `warna_kategori_news_and_blog`, `tbl_kategori_newsandblog`.`judul_kategori_news_and_blog` AS `judul_kategori_news_and_blog`
FROM `tbl_newsandblog`
JOIN `tbl_kategori_newsandblog` ON `tbl_kategori_newsandblog`.`id_kategori_news_and_blog` = `tbl_newsandblog`.`id_kategori_news_and_blog`
WHERE `tbl_newsandblog`.`deleted_at` IS NULL
ORDER BY `tbl_newsandblog`.`created_at` DESC
---
    public function getNewsAndBlogWithCategoryLimited($limit = 3, $offset = 1)
    {
        $builder = $this->db->table('tbl_newsandblog');
        $builder->join(
            'tbl_kategori_newsandblog',
            'tbl_kategori_newsandblog.id_kategori_news_and_blog = tbl_newsandblog.id_kategori_news_and_blog'
        );
        $builder->select('tbl_newsandblog.*,
        tbl_kategori_newsandblog.created_at AS kategori_created_at,
        tbl_kategori_newsandblog.warna_kategori_news_and_blog AS warna_kategori_news_and_blog,
        tbl_kategori_newsandblog.judul_kategori_news_and_blog AS judul_kategori_news_and_blog');
        $builder->where('tbl_newsandblog.deleted_at', null);
        $builder->orderBy('tbl_newsandblog.created_at', 'desc');
        $builder->limit($limit, $offset);
        $query = $builder->get();

SELECT `tbl_newsandblog`.*, `tbl_kategori_newsandblog`.`created_at` AS `kategori_created_at`, `tbl_kategori_newsandblog`.`warna_kategori_news_and_blog` AS `warna_kategori_news_and_blog`, `tbl_kategori_newsandblog`.`judul_kategori_news_and_blog` AS `judul_kategori_news_and_blog`
FROM `tbl_newsandblog`
JOIN `tbl_kategori_newsandblog` ON `tbl_kategori_newsandblog`.`id_kategori_news_and_blog` = `tbl_newsandblog`.`id_kategori_news_and_blog`
WHERE `tbl_newsandblog`.`deleted_at` IS NULL
ORDER BY `tbl_newsandblog`.`created_at` DESC
 LIMIT 1, 3
---
    public function getSiswa123()
    {
        $builder = $this->db->table('tbl_pengguna');
        $builder->join('tbl_login', 'tbl_login.id_pengguna = tbl_pengguna.id_pengguna');
        $builder->join('tbl_jurusan', 'tbl_jurusan.id_jurusan = tbl_pengguna.id_jurusan', 'left'); // Join dengan tbl_jurusan
        $builder->where('tbl_login.level', 5);
        $builder->orderBy('tbl_pengguna.is_top_1', 'DESC');
        $builder->orderBy('tbl_pengguna.is_top_2', 'DESC');
        $builder->orderBy('tbl_pengguna.is_top_3', 'DESC');
        $builder->limit(3); // Batasi hasil hingga 3 data

        // Pilih kolom-kolom yang ingin ditampilkan, termasuk kolom nama_jurusan
        $builder->select('tbl_pengguna.*, tbl_jurusan.nama_jurusan');

        $query = $builder->get();

SELECT *
FROM `tbl_newsandblog`
JOIN `tbl_kategori_newsandblog` ON `tbl_kategori_newsandblog`.`id_kategori_news_and_blog` = `tbl_newsandblog`.`id_kategori_news_and_blog`
WHERE `tbl_newsandblog`.`slug_newsandblog` = 'batalyon-cendikia-utama'
AND `tbl_newsandblog`.`deleted_at` IS NULL
---
    public function getNewsAndBlogBySlug($slug_newsandblog)
    {
        $builder = $this->db->table('tbl_newsandblog');
        $builder->join('tbl_kategori_newsandblog', 'tbl_kategori_newsandblog.id_kategori_news_and_blog = tbl_newsandblog.id_kategori_news_and_blog');
        $builder->where('tbl_newsandblog.slug_newsandblog', $slug_newsandblog);
        $builder->where('tbl_newsandblog.deleted_at', null);
        $query = $builder->get();

SELECT *
FROM `tbl_newsandblog`
JOIN `tbl_kategori_newsandblog` ON `tbl_kategori_newsandblog`.`id_kategori_news_and_blog` = `tbl_newsandblog`.`id_kategori_news_and_blog_tambahan`
WHERE `tbl_newsandblog`.`slug_newsandblog` = 'batalyon-cendikia-utama'
AND `tbl_newsandblog`.`deleted_at` IS NULL
---
    public function getNewsAndBlogBySlug2($slug_newsandblog)
    {
        $builder = $this->db->table('tbl_newsandblog');
        $builder->join('tbl_kategori_newsandblog', 'tbl_kategori_newsandblog.id_kategori_news_and_blog = tbl_newsandblog.id_kategori_news_and_blog_tambahan');
        $builder->where('tbl_newsandblog.slug_newsandblog', $slug_newsandblog);
        $builder->where('tbl_newsandblog.deleted_at', null);
        $query = $builder->get();

UPDATE `tbl_newsandblog` SET `jumlah_view` = jumlah_view + 1
WHERE `id_newsandblog` = '4'
---
    public function increaseViewCount($id_newsandblog)
    {
        $this->db->table('tbl_newsandblog')
            ->where('id_newsandblog', $id_newsandblog)
            ->set('jumlah_view', 'jumlah_view + 1', false)
            ->update();