app/Models/PenggunaModel.php

    public function getSiswa()
    {
        $builder = $this->db->table('tbl_pengguna');
        $builder->join('tbl_login', 'tbl_login.id_pengguna = tbl_pengguna.id_pengguna');
        $builder->join('tbl_jurusan', 'tbl_jurusan.id_jurusan = tbl_pengguna.id_jurusan', 'left');
        $builder->join('tbl_kelas', 'tbl_kelas.id_kelas = tbl_pengguna.id_kelas', 'left');

        // Setelah melakukan join, tambahkan kondisi untuk deleted_at=NULL
        $builder->where('tbl_login.level', 5);
        $builder->where('tbl_pengguna.deleted_at', NULL);

        $builder->orderBy('tbl_pengguna.is_top_1', 'DESC');
        $builder->orderBy('tbl_pengguna.is_top_2', 'DESC');
        $builder->orderBy('tbl_pengguna.is_top_3', 'DESC');

        // Pilih kolom-kolom yang ingin ditampilkan, termasuk kolom nama_jurusan dan nama_kelas_angka
        $builder->select('tbl_pengguna.*, tbl_jurusan.nama_jurusan, tbl_jurusan.alias_jurusan, tbl_kelas.nama_kelas_huruf, tbl_kelas.nama_kelas_romawi, tbl_kelas.nama_kelas_angka');

        $query = $builder->get();
---
SELECT `tbl_pengguna`.*, `tbl_jurusan`.`nama_jurusan`, `tbl_jurusan`.`alias_jurusan`, `tbl_kelas`.`nama_kelas_huruf`, `tbl_kelas`.`nama_kelas_romawi`, `tbl_kelas`.`nama_kelas_angka`
FROM `tbl_pengguna`
JOIN `tbl_login` ON `tbl_login`.`id_pengguna` = `tbl_pengguna`.`id_pengguna`
LEFT JOIN `tbl_jurusan` ON `tbl_jurusan`.`id_jurusan` = `tbl_pengguna`.`id_jurusan`
LEFT JOIN `tbl_kelas` ON `tbl_kelas`.`id_kelas` = `tbl_pengguna`.`id_kelas`
WHERE `tbl_login`.`level` = 5
AND `tbl_pengguna`.`deleted_at` IS NULL
ORDER BY `tbl_pengguna`.`is_top_1` DESC, `tbl_pengguna`.`is_top_2` DESC, `tbl_pengguna`.`is_top_3` DESC